Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memf.tmx
Source language: ca
Languages: es_es

source: Es tracta de pàgines web que permeten buscar documents d'Internet; s'hi ha de teclejar una o més paraules, a més d'altres condicions de recerca opcionals, com ara que els documents hagen d'estar en una llengua determinada o en un servidor determinat, i entreguen els URIs dels documents que compleixen aquestes condicions, enllaços a aquests documents i un petit resum o retall (anomenat snippet) del contingut de les pàgines desitjades.
es_es: Se trata de páginas web que permiten buscar documentos de Internet; se tiene que teclear una o más palabras, además de otras condiciones de investigación opcionales, como por ejemplo que, los documentos tengan que estar en una lengua determinada o en un servidor determinado, y contengan los URIs de los documentos que cumplen estas condiciones, enlaces a estos documentos y un pequeño resumen o recorte (llamado snippet) del contenido de las páginas deseadas.

source: Un dels buscadors més populars a l'hora d'escriure aquestes línies és Google ({http://www.google.com}); també són útils Alltheweb ({http://www.alltheweb.com}) i Altavista ({http://www.altavista.com}).
es_es: Uno de los buscadores más populares a la hora de escribir estas líneas es Google ({http://www.google.com}); también son útiles Alltheweb ({http://www.alltheweb.com}) y Altavista ({http://www.altavista.com}).

source: Els ordinadors de mà es poden connectar (amb cables o mitjançant tecnologies sense cables) a altres dispositius (ordinadors, telèfons mòbils, impressores, etc.) per compartir dades.
es_es: Los ordenadores de mano se pueden conectar (con cables o mediante tecnologías sin cables) a otros dispositivos (ordenadores, teléfonos móviles, impresoras, etc.) para compartir datos.

source: Els models actuals poden executar, en determinades circumstàncies, més d'una instrucció alhora, el que fa que de vegades s'execute una instrucció per cicle o fins i tot més d'una.
es_es: Los modelos actuales pueden ejecutar, en determinadas circunstancias, más de una instrucción a la vez, lo que hace que a veces se ejecute una instrucción por ciclo o incluso más de una.

source: Quants kilobytes (kilooctets) hi ha en un gigabyte (gigaoctet)?
es_es: \section{Preguntas y ejercicios} \begin{enumerate} \item ¿Cuántos \emph{kilobytes} hay en \emph{un gigabyte}? \begin{enumerate} \item 1.024 \item

source: No, perquè un suport és electrònic i l'altre òptic.
es_es: \item No, porque un soporte es electrónico y el otro óptico.

source: ) ) ) En aquest disc, el directori principal, ``{}'', conté un únic [sub]directori ``{prac1}''; aquest directori conté dos [sub]directoris, ``{iat}'' (que conté els fitxers ``iat1.txt'' i ``iat2.txt'') i ``{reserva}''.
es_es: ) ) ) En este disco, el directorio principal, ``{}'', contiene un único [sub]directorio ``{prac1}''; este directorio contiene dos [sub]directorios, ``{iat}'' (que contiene los ficheros ``iat1.txt'' i ``iat2.txt'') i ``{reserva}''.

source: En altres països ({ .uk}, { .nz}, { .za}) s'usen indicatius similars ({ .co}(mercial), { .ac}(adèmic), etc.) davant de l'indicatiu de país (per exemple, { www.shef.ac.uk} és la Universitat de Sheffield).
es_es: En otros países ({ .uk}, { .nz}, { .za}) se usan indicativos similares ({ .co}(comercial), { .ac}(académico), etc.) delante el indicativo de país (por ejemplo, { www.shef.ac.uk} es la Universidad de Sheffield).

source: [megahertz:] Un megahertz (MHz) és un milió de hertzs (Hz), és a dir, un milió de cicles per segon.
es_es: [megaherzio:] Un megaherzio (MHz) es un millón de herzios (Hz), es decir, un millón de ciclos por segundo.

source: Depenent de la codificació escollida per als caràcters de la imatge, ara al voltant de 600, ara al voltant de 1200.
es_es: \begin{enumerate} \item Dependiendo de la codificación escogida para los caracteres de la imagen, alrededor de 600 o alrededor de 1200.

source: L'execució d'una instrucció per part del processador sol consumir un nombre menut de cicles, quasi sempre més d'un. Una velocitat típica (any 2006) és 3 GHz, és a dir, 3000 MHz.
es_es: La ejecución de una instrucción por parte del procesador suele consumir un número pequeño de ciclos, casi siempre más de uno. Una velocidad típica (año 2006) es 3 GHz, es decir, 3000 MHz.

source: Guarda el valor de l'acumulador en índex.
es_es: Guarda el valor del acumulador en índice.

source: Cada node (cada ordinador) de la xarxa Internet té un { número IP} únic, el qual es compon de 4 octets (4 enters del 0 al 255) separats per punts, com ara { 192.168.5.5}.
es_es: Cada nudo (cada ordenador) de la red Internet tiene un { número IP} único, el cual se compone de 4 bytes (4 enteros del 0 al 255) separados por puntos, como por ejemplo { 192.168.5.5}.

source: No, primer s'hi ha de crear una carpeta (un directori).
es_es: \item No, primero se tiene que crear una carpeta (un directorio).

source: Es pot instal·lar Linux (que es presenta en moltes distribucions diferents) en un PC amb processador 386 o superior i en molts altres tipus d'ordinador.
es_es: Se puede instalar Linux (que se representa en muchas distribuciones diferentes) en un PC con procesador 386 o superior y en muchos otros tipos de ordenadores.

source: Potser cal millorar l'apartat sobre resolució de l'ambigüitat estructural pura.
es_es: Quizás haga falta mejorar el apartado sobre resolución de la ambigüedad estructural pura.

source: Informàtica Aplicada a la Traducció:
es_es: Informática Aplicada a la Traducción:

source: Com en el cas dels CD, podem parlar de DVD-ROM, DVD-R i DVD-RW.
es_es: Como en el caso de los CD, podemos hablar de DVD-ROM, DVD-R y DVD-RW.

source: El nom algorisme ve del nom d'un matemàtic que treballava a Bagdad vora l'any 825 de la nostra era, Muhammad ibn Musa al Khwarizmi, anomenat així perquè sembla que era d'una ciutat al sud del mar d'Aral anomenada Khwarizm (ara Kheva).
es_es: El nombre algoritmo viene del nombre de un matemático que trabajaba en Bagdad entorno al año 825 de nuestra era, Muhammad ibn Musa al Khwarizmi, llamado así porque parece que era de una ciudad del sur del mar Aral llamada Khwarizm (ahora Kheva).

source: Ací en teniu alguns exemples: [Processadors de text] per a preparar, modificar, emmagatzemar i imprimir documents de text (vegeu la secció ).
es_es: Aquí tenéis algunos ejemplos: [Procesadores de texto] para preparar, modificar, almacenar e imprimir documentos de texto (ver la sección ).

source: Hi ha mòdems interns, que s'instal·len dins de la caixa o torre de l'ordinador, i externs.
es_es: Hay módems internos, que se instalan dentro de la caja o torre del ordenador, y externos.

source: [targeta de xarxa:] per a connectar ordinadors i formar una xarxa (normalment local) per a compartir recursos, cada ordinador ha de tenir una placa o targeta de xarxa.
es_es: \item[tarjeta de red:] para conectar ordenadores y formar una red (normalmente local) para compartir recursos, cada ordenador tiene que tener una placa o tarjeta de red.

source: En canvi, l'URI {mailto:anton@dlsi.ua.es} serveix per a enviar correu electrònic ({ mailto}) a l'usuari que té l'adreça de correu electrònic {anton@dlsi.ua.es}.
es_es: En cambio, el URI {mailto:anton@dlsi.ua.es} sirve para enviar un correo electrónico ({ mailto}) al usuario que tiene la dirección de correo electrónico {anton@dlsi.ua.es}.

source: En l'acumulador del processador central.
es_es: \begin{enumerate} \item En el acumulador del procesador central.

source: Aquest glossari arreplega alguns termes d'ús comú en la descripció d'ordinadors i programes que no han estat definits més amunt.
es_es: Este glosario recoge algunos términos de uso común en la descripción de ordenadores y programas que no se definieron más arriba.

source: Com ja s'ha dit en la pàgina , és comú que les dades ---de qualsevol classe: textos, programes, gràfics, so, vídeo, etc.--- emmagatzemades en memòria secundària estiguen organitzades en { fitxers}.
es_es: Como ya se ha dicho en la página , es común que los datos ---de cualquier clase: textos, programas, gráficos, sonido, vídeo, etc.--- almacenados en memoria secundaria estén organizados en { ficheros}.

source: Si quan s'ha demanat la 2.000.000 es copien en la memòria cau les 524.288 posicions que van de la 1.572.864 a la 2.097.151, l'accés a la posició 2.000.003 serà més ràpida.
es_es: Si cuando se ha pedido la 2.000.000 se copian en la caché las 524.288 posiciones que van de la 1.572.864 a la 2.097.151, El acceso a la posición 2.000.003 será más rápido.

source: Si suposem que hem triat una resolució i un format d'imatge que fa que cada fotografia necessite un espai de 2048 kB, quantes tarjetes d'aquestes hem de comprar si volem fer 100 fotos al llarg d'un viatge?
es_es: Si suponemos que hemos elegido una resolución y un formato de imagen que hace que cada fotografía necesite un espacio de 2048 kB, ¿cuántas tarjetas de éstas tenemos que comprar si queremos hacer 100 fotos a lo largo de un viaje?

source: [Sistemes operatius i firmware:] són els programes que permeten el funcionament bàsic de l'ordinador.
es_es: [Sistemas operativos y firmware:] son los programas que permiten el funcionamiento básico del ordenador.

source: [Entrada:] la funció primària dels dispositius d'entrada és que l'usuari puga interactuar amb la màquina i amb els programes que executa amb la finalitat d'introduir-hi dades o informació.
es_es: [Entrada:] la función primaria de los dispositivos de entrada es que el usuario pueda interactuar con la máquina y con los programas que ejecuta con el fin de introducir datos o información.

source: Només si la impressora és compatible amb Internet.
es_es: \item Sólo si la impresora es compatible con Internet.

source: Quant a la interfície d'ús, és a dir, l'aparença i la forma d'interaccionar amb l'usuari, els sistemes operatius es poden dividir en gràfics, és a dir, basats en ratolí, punters, finestres, etc.
es_es: En cuanto a la interfaz de uso, es decir, la apariencia y la forma de interaccionar con el usuario, los sistemas operativos se pueden dividir en gráficos, es decir, basados en ratón, punteros, ventanas, etc.

source: Actualment, en molts casos, els programes de comunicació formen part dels sistemes operatius i l'usuari no s'adona que estiguen actius.
es_es: Actualmente, en muchos casos, los programas de comunicación forman parte de los sistemas operativos y el usuario no se da cuenta de que están activos.

source: Un URI.
es_es: Un pequeño glosario

source: Si el disc es diu a: (típic d'un disquet en un PC amb sistema operatiu Windows), les trajectòries d'aquests dos fitxers serien a:{}{prac1}{iat}iat1.txt i a:{}{prac1}{reserva}{iat}iat1.txt, i, per tant, serien diferents.
es_es: Si el disco duro se llama a: (típico de un disquet en un PC con un sistema operativo Windows), las trayectorias de estos dos ficheros serían a:{}{prac1}{iat}iat1.txt i a:{}{prac1}{reserva}{iat}iat1.txt, y, por tanto, serían diferentes.

source: Els programes poden estar escrits a mà en un paper, guardats en un disc o carregats en la memòria de l'ordinador mentre són executats pel processador.
es_es: Los programas pueden estar escritos a mano en un papel, guardados en un disco o cargados en la memoria del ordenador mientras son ejecutados por el procesador.

source: Si existira un llenguatge de programació de l'estil de Pascal en català, potser tindria una forma com aquesta:
es_es: Si existiera un lenguaje de programación de estilo de Pascal en castellano, puede que tuviera una forma como ésta:

source: Un algorisme (també algoritme, per interferència amb aritmètica) és una seqüència finita d'operacions executables i no ambigües que defineix un procediment que sempre es deté.
es_es: Un algoritmo es una secuencia finita de operaciones ejecutables y no ambiguas que define un procedimiento que siempre se detiene.

source: Carrega el valor d'índex en l'acumulador.
es_es: Suma el valor de índice al acumulador.

source: Un disquet de 3 polzades i mitja de densitat alta té 1,44 MB, és a dir, uns 1.440.000 octets.
es_es: Un disquete de 3 pulgadas y media de alta densidad tiene 1,44 MB, es decir, unos 1.440.000 bytes.

source: El directori ``{reserva}'' conté un subdirectori ``{iat}'' (que conté l'arxiu ``iat1.txt)''.
es_es: El directorio ``{reserva}'' contiene un subdirectorio ``{iat}'' (que contiene el archivo ``iat1.txt)''.

source: En l'actualitat esta diferència no existeix i tant uns com altres empren processadors de la família 86.
es_es: Actualmente esta diferencia no existe y tanto unos como otros utilizan procesadores de la familia 86.

source: Les instruccions dels programes, com el de l'exemple, que sumava tots els enters del 1 al 10, també s'emmagatzemen en octets: per exemple, la instrucció { inc A}, que incrementa l'acumulador en 1, podria ser l'octet { 11010110}.
es_es: Las instrucciones de los programas, como el del ejemplo, que sumaba todos los enteros del 1 al 10, también se almacenan en bytes: por ejemplo, la instrucción { inc A}, que incrementa el acumulador en 1, podría ser el byte { 11010110}.

source: Es pot fer que diversos ordinadors compartisquen un recurs connectat a un d'ells com, per exemple, una impressora?
es_es: \item ¿Se puede hacer que varios ordenadores compartan un recurso conectado a uno de ellos como, por ejemplo, una impresora?

source: Fixeu-vos que alguns indicatius (.tv, .fm, etc.) s'usen per a aplicacions no estrictament relacionades amb aquestos països.}
es_es: Fijaos que algunos indicativos (.tv, .fm, etc.) se usan para aplicaciones no estrictamente relacionadas con estos países.}

source: D'altra banda, sovint es fa la distinció entre els ordinadors de tipus PC i els Macinstosh (sovint anomenats Mac); els PC són l'evolució dels primers ordinadors personals desenvolupats per IBM, tot i que actualment són fabricats per un nombre molt gran d'empreses; els Mac són fabricats exclusivament per l'empresa Apple Computers, tenen un sistema operatiu propi i una quota de mercat molt més reduïda.
es_es: Por otro lado, a menudo se hace una distinción entre los ordenadores de tipo PC y los Macinstosh (a los que se llama Mac); los PC son la evolución de los primeros ordenadores personales desarrollados por IBM, aunque actualmente los fabrican muchas empresas; los Mac son fabricados exclusivamente por la empresa Apple Computers, tienen un sistema operativo propio y una cuota de mercado mucho más reducida.

source: {} el conjunt d'instruccions del processador A i el conjunt d'instruccions del processador B contenen un grup d'instruccions comunes.
es_es: \item {\ldots} el conjunto de instrucciones del procesador \begin{math}A\end{math} contiene todas las instrucciones del procesador \begin{math}B\end{math}.

source: Suma el valor d'índex a l'acumulador.
es_es: Suma el valor de índice al acumulador.

source: Els números IP es componen de 4 números del 0 al 255 separats per punts.
es_es: Los números IP se componen de 4 números del 0 al 255 separados por puntos.

source: No, perquè la memòria RAM s'esborra quan falta l'alimentació elèctrica.
es_es: \begin{enumerate} \item No, porque la memoria RAM se borra cuando no hay alimentación eléctrica.

source: [mòdem:] abreviatura de modulador-desmodulador.
es_es: [módem:] abreviatura de modulador-desmodulador.

source: Caben $6.000.000.000/3.000=2.000.000$ pàgines en un disc.
es_es: Caben $6.000.000.000/3.000=2.000.000$ páginas en un disco.

source: És ràpida, volàtil i d'accés aleatori.
es_es: \item Es rápida, volátil y de acceso aleatorio.

source: El llibre és bàsicament una compilació de procediments algebraics i geomètrics, és a dir, d'algorismes.
es_es: El libro es básicamente una compilación de procedimientos algebraicos y geométricos, es decir, dealgoritmos.

source: [Macintosh] o Mac: nom genèric (i comercial) d'una família d'ordinadors construïts per Apple Computer i que són bàsicament equivalents als PC.
es_es: [Macintosh] o Mac: nombre genérico (y comercial) de una familia de ordenadores construidos por Apple Computer y que son básicamente equivalentes a los PC.

source: Això evita el parpalleig de les pantalles clàssiques i en redueix la grandària, tot i que també incrementa el preu.
es_es: Un monitor o pantalla, normalmente una pantalla plana TFT{Las pantallas TFT (del inglés thin-film transistor) no llevan ningún tubo de rayos catódicos, sino que usan uno o más transitores para cada punto de la pantalla.

source: En els dos casos, si hi enviem un missatge, el reben tots els inscrits, de manera que es pot usar per a establir, per exemple, fòrums de discussió..
es_es: En los dos casos, si mandamos un mensaje, lo reciben todos los inscritos, de forma que se puede usar para establecer, por ejemplo, foros de discusión..

source: Per tant, per a enviar el disquet són necessaris \((1.440.000 B)/(3.600 B/s)=400\) segons, que són uns 7 minuts.
es_es: Por lo tanto, para enviar el disquete son necesarios \((1.440.000~B)/(3.600~B/s)=400\) segundos, que son unos 7 minutos.

source: S'anomena Internet a un conjunt d'ordinadors, distribuïts arreu del món i interconnectats mitjançant un protocol estàndard (el protocol d'Internet o IP) de manera que els recursos presents en uns ordinadors (normalment, informació) estan disponibles per a ser usats pels usuaris d'altres ordinadors.
es_es: Se denomina Internet a un conjunto de ordenadores, distribuidos en todo el mundo e interconectados mediante un protocolo estándar (el protocolo de Internet o IP) de forma que los recursos presentes en ciertos ordenadores (normalmente, información) están disponibles para ser usados por los usuarios de otros ordenadores.

source: L'accés es fa mitjançant un nom d'usuari i una contrasenya.
es_es: El acceso se hace mediante un nombre de usuario y una contraseña.

source: Hi ha diversos estàndards de connexió en xarxa; els més anomenats són Ethernet i Token Ring.
es_es: Hay varios estándares de conexión en red;

source: Els algorismes s'enuncien en imperatiu, com si fossen ordres que es donen a algú perquè les execute seqüencialment, excepte quan es trenca l'ordre amb una instrucció ``Vés a''.
es_es: Los algoritmos se enuncian en imperativo, como si fueran órdenes que se dan a alguien para que las ejecute secuencialmente, excepto cuando se rompe la orden com una instrucción ``Ve a''.

source: A més, és segur que hi ha errades que s'han de corregir.
es_es: Además, es seguro que hay erratas que han de corregirse.

source: Accés inalàmbric Wi-Fi (vegeu el glossari ), com el que va oferir el 2003 l'empresa Afitel a unes 1200 llars en la ciutat castellana de Zamora, a 9,90 euros al mes, però que es va interrompre als sis mesos de començar.
es_es: Acceso inalámbrico Wi-Fin (ver el glosario ), como el que ofreció en 2003 la empresa Afitel a unos 1200 hogares en la ciudad castellana de Zamora, a 9,90 euros al mes, pero que se interrumpió a los seis meses de empezar.

source: En l'actualitat, d'una banda, la major part dels ISP ofereixen el servei d'Internet gratuïtament de manera que només s'han de pagar les telefonades, però, d'altra banda, molts proveïdors d'Internet estan associats a companyies telefòniques i ofereixen descomptes si l'accés es fa a través d'una companyia concreta.
es_es: En la actualidad, por un lado, la mayor parte de los ISP ofrecen el servicio de Internet gratuitamente, de forma que sólo se tienen que pagar las llamadas, pero, por otro lado, muchos proveedores de Internet están asociados a compañías telefónicas y ofrecen descuentos si el acceso se hace a través de una compañía concreta.

source: De fet, aprofitem per donar les gràcies a totes les persones (alumnat, professorat, etc.) que, amb els seus comentaris crítics, han anat millorant aquest text.
es_es: De hecho, aprovechamos para dar las gracias a todas las personas (alumnado, profesorado, etc.) que, con sus comentarios críticos, han ido mejorando este texto.

source: Exercicis i qüestions
es_es: Ejercicios y cuestiones

source: Si la velocitat del mòdem és de 28.800 bits per segon, és de \(28.800/8=3.600\) octets per segon.
es_es: Si la velocidad del módem es de 28.800 bits por segundo, es de \(28.800/8=3.600\) bytes por segundo.

source: En la Universitat d'Alacant hi havia 32050 alumnes durant el curs 2001--2002.
es_es: \item En la Universitat de Alicante había 32050 alumnos durante el curso 2001--2002.

source: La configuració clàssica d'un ordinador personal model 2006 sol ser més o menys com segueix: La unitat base (la ``caixa'' o la ``torre'') conté: El processador (típicament un Pentium d'Intel d'uns 3 GHz o un processador equivalent de la marca AMD), La memòria RAM (per exemple, de 1 GB), Una bona targeta gràfica, Un disc fix amb una capacitat de l'ordre dels 320 GB, la unitat de disquet, Una unitat enregistradora de DVD i de CD-ROM Una targeta de so amb altaveus i micròfon.
es_es: La configuración clásica de un ordenador personal modelo 2006 suele ser más o menos como sigue: La unidad base (la ``caja'' o la ``torre'') contiene: El procesador (típicamente un Pentium de Intel de unos 3 GHz o un procesador equivalente de la marca AMD), La memoria RAM (por ejemplo, de 1 GB), Una buena tarjeta gráfica, Un disco fijo con una capacidad del orden de los 320 GB, la unidad del disquet, Una unidad grabadora de DVD y de CD-ROM Una tarjeta de sonido con altavoces y micrófono.

source: Un mòdem és un dispositiu que{}
es_es: \end{enumerate} \item Un módem es un dispositivo que{\ldots}

source: [1.] Fes que $p$ valga 1 ($p$ indica la posició actual dins de les seqüències que estem comparant: $p=1$, per al primer caràcter, $p=2$, per al segon, etc.) [2.] Si no existeix la posició $p$ de $A$, vés a 7.
es_es: [1.] Haz que $p$ valga 1 ($p$ indica la posición actual dentro de las secuencias que estamos comparando: $p=1$, para el primer caracter, $p=2$, para el segundo, etc.) [2.] Si no existe la posición $p$ de $A$, ve a 7.

source: { ALGORISME COMPARA2 Entrada: Dues seqüències de caràcters $A$ i $B$, acabades en `\$'. Eixida: Sí, si són iguals; no si no ho són.
es_es: { ALGORITMO COMPARA Entrada: Dos secuencias de caracteres $A$ i $B$, acabadas en `\$'. Salida: Sí, si son iguales; no si no lo son.

source: Com que un octet pot contenir poca informació, normalment es parla de: kilooctets o kilobytes (kB), o milers d'octets.
es_es: Como un byte puede contener poca información, normalmente se habla de: kilobytes (kB), o miles de bytes.

source: Missatgeria instantània i xat
es_es: Mensajería instantánea y chat

source: Podem esperar que l'execució dels programes continue en el mateix punt on es trobava quan les bateries van fallar?
es_es: ¿Podemos esperar que la ejecución de los programas continúe en el mismo punto donde se encontraba cuando las baterías fallaron?

source: Una persona connectada a Internet per telèfon observa que les velocitats de transferència que li indica el seu navegador (vegeu el capítol ) varien al voltant dels 3 kilooctets (kilobytes) per segon.
es_es: \item Una persona conectada a Internet por teléfono observa que las velocidades de transferencia que le indica su navegador (ver el capítulo~\ref{se:Internet}) varían alrededor de los 3~(\emph{kilobytes}) por segundo.

source: Sí, si tenen data i hora diferents.
es_es: \item Sí, si tienen fecha y hora diferentes.

source: Actualment no es pot transferir un megabit per segon per una línia telefònica domèstica usant un mòdem telefònic convencional.
es_es: \item Actualmente no se puede transferir un megabit por segundo por una línea telefónica doméstica usando un módem telefónico convencional.

source: Pot un fitxer contenir les instruccions d'un programa executable?
es_es: \item ¿Puede un fichero contener las instrucciones de un programa ejecutable?
